
[
    "\n\n<:update:990097698667503696> **Boolean v2.1.0** | Legacy Commands & Permits\n\n**-** Added a permit system for commands\n   **-** The command permissions work completely off of the permit system. Discord permissions no longer gives access to Boolean's commands.\n   **-** *Note: Anyone with access to a certain moderation command cannot be punished by that command.*\n   **+** /permit View Permits\n   **+** /permit Create Permit [Permit Name]\n   **+** /permit Delete Permit [Permit Name]\n   **+** **Visit the docs for the full usage of /permit**\n      **-** *Note: Owners of any given guild have automatic access to every command.*\n\n**- **Added back legacy commands\n   **- ** *Note: legacy commands function differently from slash commands. **!!help [Command]** has returned. Along with the docs explaining how each command works.*\n   **-** Ban modifiers do not exist for **!!ban**\n   **+ **Added **!!softban**\n   **+** Hidden legacy commands have returned :hypixel_wink:\n\n**-** __General Changes__\n   **+** Minor refactoring to make everything more consistent\n   **+** Bug fixes\n   **+** Stability improvements\n   **+** Added a maintenance system when necessary\n   **+** Added the **reason** command. In the production of Boolean and eventual release the reason command got left out.\n   **+** Added `deleteCommandUsage` as a config option. When enabled all legacy commands ran will be deleted after 3 seconds.\n   **+** Automated `!!help` so new commands will always be displayed\n   **-** Removed `/modrole` and `/adminrole` in favour of permits\n**__Check out the docs: Coming Soon__**",
    "\n\n<:update:990097698667503696> **Boolean v2.0.0** | Rewrite\n> When transferring to slash commands only and resolving the command handler being unreliable I decided it was a good chance to rewrite Boolean as a whole. Every one of Boolean's command has been made more efficient while making Boolean's command handler more reliable than ever!\n\n> <:no:979193272784265217> Remove the ability to disable commands via /command\n> <:no:979193272784265217> Remove legacy commands. Boolean will not longer respond to !! as a prefix.\n> <:no:979193272784265217> Help command removed as slash commands show everything you need!\n> <:no:979193272784265217> Soft Ban command removed in favour of an added \"Modifiers\" option with /ban\n\n> <:plus:979475666963681320> Stability and efficiency improvements.\n> <:plus:979475666963681320> /updates command added to serve the function of the help commands change logs.\n> <:plus:979475666963681320> Added a \"delete_days\" option to /ban so you can chose to delete a user's past messages.\n\n> <:yes:979193272612298814> History command is now more stable, you can not longer go a undefined page of one's history.\n> <:yes:979193272612298814> DM punish message has been changed, looks nicer :D\n> <:yes:979193272612298814> The ban & mute command have been made more intuitive with slash commands.\n> <:yes:979193272612298814> Temporary ban check interval has been reduced to 30 seconds.\n\n> <:clockAlert:976328467824119828> With this admin roles and mod roles not longer affect what commands they can run, that is dictated by slash command permissions.\n\n> Most of these changes are back end but help Boolean run as a whole. More legit updates are in the works!",
    "\n\n<:update:990097698667503696> **Boolean v1.1.1** | Auto Moderation <:beta:990097699762225152><:beta2:990097700856950834><:beta3:990097701754511390>\n\n> *These features will be coming to Boolean publicly but they are still in beta and are subject to change.*\n> The long awaited AutoMod update is here! Because of Discord built in AutoMod Boolean doesn't and wont support chat filters.\n\n> <:plus:979475666963681320> Added command **!!automod & /automod**\n> <:plus:979475666963681320> New Auto-Moderation features\n>       <:pencil:977391492916207636> **Usage:** `!!automod [Sub Command/Help] [Value]`\n>       <:recommended:979475658000437258> **Block Links** Block any an all links, with a editable whitelist so you can allow any websites you want.\n>       <:recommended:979475658000437258> **Block Scams** Blocks all Discord Nitro scam websites on file. *Not necessary if Block Links is enabled*\n>       <:recommended:979475658000437258> **Mass Mentions** Block user from mass pinging  users in your server\n>       <:recommended:979475658000437258> **Mentions Cap** Set the cap of mentions people an use to trigger AutoMod.\n>       <:recommended:979475658000437258> **Whitelist** Add a whitelisted website to **Block Links**\n> <:plus:979475666963681320> Database changes (None that affect you, just stability)\n\n> <:clockAlert:976328467824119828> *If you are to use this update you are obligated to report bugs as it IS still in beta.*",
    "\n\n<:update:990097698667503696> **Boolean v1.1.0** | Slash Commands & More!\n\n> Boolean has been effectively rewritten, every command now supports slash commands, a few renamed, and many changes. This update also should help Boolean's stability, but we'll see!\n\n> <:plus:979475666963681320> !!<command> -> !!<command> & /<command>\n> <:plus:979475666963681320> Security and stability updates\n> <:plus:979475666963681320> Mod logs will now display more accurate details on the command ran\n> <:plus:979475666963681320> https://discordbotlist.com/bots/boolean button added to !!invite\n> <:plus:979475666963681320> Completely new command handler that supports slash command and improves stability\n> <:plus:979475666963681320> Ability to disabled commands via !!command\n> <:plus:979475666963681320> Unban & Unmute now create a case file & will show up on a user's history\n> <:plus:979475666963681320> Added \"DM User When Punished\" to !!config\n\n> 🛑  These are very large changes, you probably will encounter bugs. Please report these if they arise, thanks! Also! Some settings have been reset, such as your server prefix since some database changes were made.",
    "\n\n<:update:990097698667503696> **Boolean v1.0.1** | Auto Mute\n\nBoolean can now automatically mute a user with a specified amount of warns. By default this limit is `3` but can be changed by running `!!automute warnsmute [Number]` When exceeded the user will be muted for 10 minutes. Have any feedback? Have a chat in general"
]